Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.PointCloud Property
 An external resource type representing Point Clouds. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType PointCloud { get; }
Visual Basic
Public Shared ReadOnly Property PointCloud As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ PointCloud {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace